In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Sex':['M','F','F','D','?'],
    'Age':[29,30,24,290,25],
})

In [3]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [4]:
df['Sex'].unique() #it shows only the section you want to deal with

array(['M', 'F', 'D', '?'], dtype=object)

In [5]:
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [6]:
df['Sex'].replace('D','F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [7]:
df['Sex'].replace({'D':'F','N':'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [8]:
df.replace({
    'Sex': {
        'D':'F',
        'N':'M'
    },
    'Age': {
        290:29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [9]:
df[df['Age']>100] #shows the df item with the condition df['Age']>100

  Sex  Age
3   D  290

In [10]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [11]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [12]:
#string str 
#day&time dt

Duplicates!

In [13]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gerard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth',
])

In [14]:
ambassadors

Gerard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [15]:
ambassadors.duplicated()

Gerard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [16]:
ambassadors.duplicated(keep='last')

Gerard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [17]:
ambassadors.duplicated(keep=False)

Gerard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [18]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [19]:
ambassadors.drop_duplicates(keep='last')

Gerard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [20]:
ambassadors.drop_duplicates(keep=False)

Gerard Araud          France
Armando Varricchio     Italy
dtype: object

In [21]:
players = pd.DataFrame({
    'Name':[
        'Kobe Bryant',
        'Lebron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos':[
        'SG',
        'SF',
        'SG',
        'SF',
        'SF',
    ]
})

In [22]:
players

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [23]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [24]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [25]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [27]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [30]:
players.drop_duplicates(subset=['Name'])

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
3  Carmelo Anthony  SF

In [31]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
1     Lebron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [51]:
df = pd.DataFrame({
    'Data':[
        '1978_M_US_1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_      IT_1',
        '1985_F_I  T_2'
    ]})

In [52]:
df

                 Data
0         1978_M_US_1
1        1990?_M_UK_1
2         1992_F_US_2
3  1970?_M_      IT_1
4       1985_F_I  T_2

In [53]:
df['Data'].str.split('_')

0           [1978, M, US, 1]
1          [1990?, M, UK, 1]
2           [1992, F, US, 2]
3    [1970?, M,       IT, 1]
4         [1985, F, I  T, 2]
Name: Data, dtype: object

In [54]:
df['Data'].str.split('_', expand=True)

       0  1         2  3
0   1978  M        US  1
1  1990?  M        UK  1
2   1992  F        US  2
3  1970?  M        IT  1
4   1985  F      I  T  2

In [55]:
df = df['Data'].str.split('_', expand=True)

In [56]:
df.columns = ['Year','Sex','Country','No Childer']

In [57]:
df

    Year Sex   Country No Childer
0   1978   M        US          1
1  1990?   M        UK          1
2   1992   F        US          2
3  1970?   M        IT          1
4   1985   F      I  T          2

In [58]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [59]:
df['Country'].str.contains('U')

0     True
1     True
2     True
3    False
4    False
Name: Country, dtype: bool

In [60]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [61]:
df['Country'].str.replace(' ','')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [63]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

/tmp/ipykernel_9244/2331653364.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group('year'))

0    1978
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object